In [2]:
%load_ext sql

In [3]:
%sql mysql+mysqlconnector://root:root@localhost

In [4]:
%%sql
CREATE DATABASE mydb;

 * mysql+mysqlconnector://root:***@localhost
(mysql.connector.errors.DatabaseError) 1007 (HY000): Can't create database 'mydb'; database exists
[SQL: CREATE DATABASE mydb;]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [5]:
%%sql
USE mydb;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [6]:
%%sql
SHOW TABLES;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [7]:
%%sql
create database learning;

 * mysql+mysqlconnector://root:***@localhost
(mysql.connector.errors.DatabaseError) 1007 (HY000): Can't create database 'learning'; database exists
[SQL: create database learning;]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [8]:
%%sql
use learning

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [9]:
%%sql
create table test ( Sno int , name varchar(100));

 * mysql+mysqlconnector://root:***@localhost
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'test' already exists
[SQL: create table test ( Sno int , name varchar(100));]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [10]:
%%sql 
select * from test;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[(1, 'T B guru'), (2, 'Akash')]

In [11]:
%%sql 
insert into test(Sno,name)values(1,'Guru');

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [12]:
%%sql 
insert into test(Sno,name)values(2,'Akash');

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [13]:
%%sql
update test set name = 'T B guru' where sno =1;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[]

In [14]:
%%sql 
select * from test;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[(1, 'T B guru'), (2, 'Akash'), (1, 'T B guru'), (2, 'Akash')]

In [16]:
%%sql
delete from test where sno = 1;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[]

In [19]:
%%sql
select * from test;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[(2, 'Akash'), (2, 'Akash')]

In [20]:
%%sql 
truncate table test;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [21]:
%%sql
drop table test;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]